IRP/src/Enums/DebtTypes/DebtTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>DebtTypes</name>
  <enumValues>
    <name>AdvanceVendor</name>
  </enumValues>
  <enumValues>
    <name>TransactionVendor</name>
  </enumValues>
  <enumValues>
    <name>AdvanceCustomer</name>
  </enumValues>
  <enumValues>
    <name>TransactionCustomer</name>
  </enumValues>
  <enumValues>
    <name>DELETE_OtherPartnerPayable</name>
  </enumValues>
  <enumValues>
    <name>OtherPartnerReceivable</name>
  </enumValues>
  <enumValues>
    <name>DELETE_EmployeePayable</name>
  </enumValues>
  <enumValues>
    <name>EmployeeReceivable</name>
  </enumValues>
</mdclass:Enum>

IRP/src/Enums/DebtTypes/ManagerModule.bsl
Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)
	StandardProcessing = False;
	ChoiceData = New ValueList();
	ChoiceData.Add(AdvanceVendor);
	ChoiceData.Add(TransactionVendor);
	ChoiceData.Add(AdvanceCustomer);
	ChoiceData.Add(TransactionCustomer);
	ChoiceData.Add(OtherPartnerReceivable);
	ChoiceData.Add(EmployeeReceivable);
EndProcedure
